#+title: tax

*** apache2

use the file ~conf/etc/apache2/sites-available/tax.example.com.conf~
for routing https traffic to the backend.

then

#+begin_src bash
  sudo a2ensite tax.example.com
  sudo systemctl restart apache2
  pipenv install
  pipenv run gunicorn wsgi:app -b '[::]:8082'
#+end_src

then http get requests to https://tax.example.com/api will go to
unicorn

what follows is a block showing the request, then another block
showing the important parts of the response.

#+begin_src verb
  get http://tax.example.com/api/csrf-token
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Set-Cookie: session=eyJjc3JmX3Rva2VuIjoiZTUwYmVkZmY0MDI3N2Q4NDA2ZTQ3NmVkM2E1MWExZDI2ZWU4ZDUzMyJ9.Z4nRXw.C4dXjsFJVGOnQBAWU04NqgPDYVA; Secure; HttpOnly; Path=/; SameSite=Lax

{
  "csrf_token": "ImU1MGJlZGZmNDAyNzdkODQwNmU0NzZlZDNhNTFhMWQyNmVlOGQ1MzMi.Z4nRXw.fNZXik2DZpiJjsmhxjjzkz9RONs"
}
#+end_example

